Repository: 1ASI0730-2520-7426-Grupo3/Backend
Catalog: coolgym-webapi/Resources/coolgym_webapi.Contexts.maintenance.Interfaces.REST.MaintenanceRequestsController.*.resx
Languages: es

source: An error occurred while creating the maintenance request.
es: Ocurrió un error al crear la solicitud de mantenimiento.

source: An error occurred while updating the maintenance request.
es: Ocurrió un error al actualizar la solicitud de mantenimiento.

source: An error occurred while deleting the maintenance request.
es: Ocurrió un error al eliminar la solicitud de mantenimiento.

source: Maintenance request with id {0} was not found.
es: No se encontró una solicitud de mantenimiento con id {0}.

source: Equipment with id {0} was not found.
es: No se encontró un equipo con id {0}.

# ObservationEmpty
source: Observation cannot be empty.
es: La observación no puede estar vacía.

# ObservationTooShort
source: Observation must be at least {0} characters long. Current length: {1}.
es: La observación debe tener al menos {0} caracteres. Longitud actual: {1}.

# SelectedDateNotFuture
source: Selected date must be in the future.
es: La fecha seleccionada debe ser en el futuro.

# SelectedDateTooSoon
source: Selected date must be at least {0} hours in the future. Current difference: {1:F1} hours.
es: La fecha seleccionada debe ser al menos {0} horas en el futuro. Diferencia actual: {1:F1} horas.

# InvalidStatus
source: Status '{0}' is invalid.
es: El estado '{0}' es inválido.

source: Maintenance request of this equipment already exists.
es: Ya existe una solicitud de mantenimiento para este equipo.
