Repository: 1ASI0730-2520-7426-Grupo3/Backend
Catalog: coolgym-webapi/Resources/coolgym_webapi.Contexts.Equipments.Interfaces.REST.EquipmentsController.*.resx
Languages: es

source: An error occurred while creating the equipment
es: Ocurrió un error al registrar el equipo

source: An error occurred while updating the equipment
es: Ocurrió un error al actualizar el equipo

source: An error occurred while deleting the equipment
es: Ocurrió un error al eliminar el equipo

source: Equipment with id {0} not found
es: Equipo con id {0} no encontrado

# EquipmentNotFound
source: Equipment with id {0} not found.
es: El equipo con id {0} no fue encontrado.

# DuplicateSerialNumber
source: Equipment with serial number '{0}' already exists.
es: Ya existe un equipo con el número de serie '{0}'.

# EquipmentPoweredOn
source: Cannot delete equipment '{0}' because it is powered on. Please turn it off first.
es: No se puede eliminar el equipo '{0}' porque está encendido. Por favor, apáguelo primero.

# EquipmentInMaintenance
source: Cannot delete equipment '{0}' because it is under maintenance.
es: No se puede eliminar el equipo '{0}' porque está en mantenimiento.

# InvalidStatus
source: The status '{0}' is invalid.
es: El estado '{0}' no es válido.

# LocationNameEmpty
source: Location name cannot be empty.
es: El nombre de la ubicación no puede estar vacío.

# LocationNameTooLong
source: Location name cannot exceed 100 characters. Current length: {0}
es: El nombre de la ubicación no puede exceder los 100 caracteres. Longitud actual: {0}

# LocationAddressEmpty
source: Location address cannot be empty.
es: La dirección de la ubicación no puede estar vacía.

# LocationAddressTooLong
source: Location address cannot exceed 200 characters. Current length: {0}
es: La dirección de la ubicación no puede exceder los 200 caracteres. Longitud actual: {0}

# ControlPowerEmpty
source: Power status cannot be empty.
es: El estado de energía no puede estar vacío.

# ControlStatusEmpty
source: Control status cannot be empty.
es: El estado de control no puede estar vacío.

# ControlNegativeMinLevel
source: Minimum level cannot be negative. Value: {0}
es: El nivel mínimo no puede ser negativo. Valor: {0}

# ControlInvalidRange
source: Maximum level ({0}) must be greater than minimum level ({1}).
es: El nivel máximo ({0}) debe ser mayor que el nivel mínimo ({1}).

# ControlCurrentLevelOutOfRange
source: Current level ({0}) must be between {1} and {2}.
es: El nivel actual ({0}) debe estar entre {1} y {2}.

# ControlSetLevelOutOfRange
source: Set level ({0}) must be between {1} and {2}.
es: El nivel a establecer ({0}) debe estar entre {1} y {2}.

# UsageTotalMinutesNegative
source: Total minutes cannot be negative. Value: {0}
es: Los minutos totales no pueden ser negativos. Valor: {0}

# UsageTodayMinutesNegative
source: Today minutes cannot be negative. Value: {0}
es: Los minutos de hoy no pueden ser negativos. Valor: {0}

# UsageNegativeCalories
source: Calories cannot be negative. Value: {0}
es: Las calorías no pueden ser negativas. Valor: {0}

# UsageTodayExceedsTotal
source: Today minutes ({0}) cannot exceed total minutes ({1}).
es: Los minutos de hoy ({0}) no pueden exceder los minutos totales ({1}).

# GenericValidationFailure
source: Invalid data provided.
es: Datos de entrada inválidos.
