Repository: 1ASI0730-2520-7426-Grupo3/Backend
Catalog: coolgym-webapi/Resources/coolgym_webapi.Contexts.Rentals.Interfaces.REST.RentalRequestsController.*.resx
Languages: es

source: Authentication required.
es: Autenticación requerida.

source: Only providers can update rental request status.
es: Solo los proveedores pueden actualizar el estado de las solicitudes de alquiler.

source: Only clients can create rental requests.
es: Solo los clientes pueden crear solicitudes de alquiler.

source: Only providers can approve rental requests.
es: Solo los proveedores pueden aprobar las solicitudes de alquiler.

# RentalRequestNotFound
source: Rental request with id {0} was not found.
es: No se encontró una solicitud de alquiler con id {0}.

# ErrorCreatingRentalRequest
source: An error occurred while creating the rental request.
es: Ocurrió un error al crear la solicitud de alquiler.

# ErrorUpdatingRentalRequest
source: An error occurred while updating the rental request.
es: Ocurrió un error al actualizar la solicitud de alquiler.

# ErrorApprovingRentalRequest
source: An error occurred while approving the rental request.
es: Ocurrió un error al aprobar la solicitud de alquiler.

# InvalidRentalStatus
source: The rental request status is invalid.
es: El estado de la solicitud de alquiler no es válido.

# OnlyPendingRequestsCanBeApproved
source: Only pending rental requests can be approved.
es: Solo se pueden aprobar solicitudes de alquiler en estado pendiente.

# GenericRentalOperationFailure
source: The rental request operation could not be completed.
es: No se pudo completar la operación sobre la solicitud de alquiler.
