Repository: 1ASI0730-2520-7426-Grupo3/Backend
Catalog: coolgym-webapi/Resources/coolgym_webapi.Contexts.ClientPlans.Interfaces.REST.ClientPlansController.*.resx
Languages: es

# Plan.Basic.Name
source: Basic
es: Básico

# Plan.Basic.Description
source: Perfect for individual users. Access to up to 6 machines.
es: Perfecto para usuarios individuales. Acceso a hasta 6 máquinas.

# Plan.Standard.Name
source: Standard
es: Estándar

# Plan.Standard.Description
source: For active users. Access to up to 12 machines with maintenance support.
es: Para usuarios activos. Acceso a hasta 12 máquinas con soporte de mantenimiento.

# Plan.Premium.Description
source: For power users. Access to up to 24 machines with full support.
es: Para usuarios avanzados. Acceso a hasta 24 máquinas con soporte completo.

# Plan.Small Company.Name
source: Small Company
es: Empresa Pequeña

# Plan.Small Company.Description
source: Perfect for small businesses. Manage up to 10 clients.
es: Perfecto para pequeñas empresas. Gestiona hasta 10 clientes.

# Plan.Medium Company.Name
source: Medium Company
es: Empresa Mediana

# Plan.Medium Company.Description
source: Ideal for growing companies. Manage up to 30 clients with maintenance support.
es: Ideal para empresas en crecimiento. Gestiona hasta 30 clientes con soporte de mantenimiento.

# Plan.Enterprise Premium.Name
source: Enterprise Premium
es: Empresa Premium

# Plan.Enterprise Premium.Description
source: Ultimate solution for large enterprises. Unlimited clients with priority support.
es: Solución definitiva para grandes empresas. Clientes ilimitados con soporte prioritario.

# ClientPlanNotFound
source: Client plan with ID {0} not found.
es: No se encontró el plan con ID {0}.
